# Importing Data to Pandas

## Objectives

Provide examples of how to import data from common sources, including:
* CSV files
* Excel files
* SQL databases
* Zipped files
* Webpages
* APIs

Pandas makes it simple to import data into a DataFrame.

In [11]:
# generally required imports
import numpy as np
import pandas as pd

## Import CSV Files

CSV stands for comma-seperated files. If you imagine a spreadsheet, then this describes data that is in cells that are separated by commas. Any separator is valid, but the most common are commas, tabs and semi-colons.

In [3]:
tips = pd.read_csv('data/tips.csv')
tips.head()

   total_bill   tip     sex smoker  day    time  size  fraction
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [7]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
total_bill    244 non-null float64
tip           244 non-null float64
sex           244 non-null object
smoker        244 non-null object
day           244 non-null object
time          244 non-null object
size          244 non-null int64
fraction      244 non-null float64
dtypes: float64(3), int64(1), object(4)
memory usage: 15.3+ KB

## Import Excel files

Excel spreadsheets are a common format for organizing and storing information. Many businesses will provide their data in this form or expect cleaned data or an analysis in this form.

In [5]:
airlines = pd.read_excel('data/AmazingMartEU2.xlsx')
airlines.head()

,Order ID,Order Date,Customer Name,City,Country,Region,Segment,Ship Date,Ship Mode,State
0,BN-2011-7407039,2011-01-01,Ruby Patel,Stockholm,Sweden,North,Home Office,2011-01-05,Economy Plus,Stockholm
1,AZ-2011-9050313,2011-01-03,Summer Hayward,Southport,United Kingdom,North,Consumer,2011-01-07,Economy,England
2,AZ-2011-6674300,2011-01-04,Devin Huddleston,Valence,France,Central,Consumer,2011-01-08,Economy,Auvergne-Rh么ne-Alpes
3,BN-2011-2819714,2011-01-04,Mary Parker,Birmingham,United Kingdom,North,Corporate,2011-01-09,Economy,England
4,AZ-2011-617423,2011-01-05,Daniel Burke,Echirolles,France,Central,Home Office,2011-01-07,Priority,Auvergne-Rh么ne-Alpes

In [6]:
airlines.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4117 entries, 0 to 4116
Data columns (total 10 columns):
Order ID         4117 non-null object
Order Date       4117 non-null datetime64[ns]
Customer Name    4117 non-null object
City             4117 non-null object
Country          4117 non-null object
Region           4117 non-null object
Segment          4117 non-null object
Ship Date        4117 non-null datetime64[ns]
Ship Mode        4117 non-null object
State            4117 non-null object
dtypes: datetime64[ns](2), object(8)
memory usage: 321.7+ KB

## Import SQL Data

In [12]:
# required for working with sqlite database
import sqlite3

In [34]:
connection = sqlite3.connect('data/census.sqlite')
# sql_df = pd.read_sql('data/census.sqlite', con='//sqlite')

In [35]:
df = pd.read_sql_query("""SELECT *
                          FROM census""", connection)

In [36]:
df.head()

      state sex  age  pop2000  pop2008
0  Illinois   M    0    89600    95012
1  Illinois   M    1    88445    91829
2  Illinois   M    2    88729    89547
3  Illinois   M    3    88868    90037
4  Illinois   M    4    91947    91111

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8772 entries, 0 to 8771
Data columns (total 5 columns):
state      8772 non-null object
sex        8772 non-null object
age        8772 non-null int64
pop2000    8772 non-null int64
pop2008    8772 non-null int64
dtypes: int64(3), object(2)
memory usage: 342.7+ KB

## Import Zipped Files

In [13]:
from zipfile import ZipFile
z = ZipFile('data/Baby names.zip')

Import a single CSV file from the zipped file.

In [14]:
names = pd.read_csv(z.open('Baby names/names1981.csv'))
names.head()

  Jennifer  F  57032
0  Jessica  F  42519
1   Amanda  F  34370
2    Sarah  F  28162
3  Melissa  F  28003
4      Amy  F  20337

Import multiple CSV files from the zipped file.

In [17]:
dfs = {text_file.filename: pd.read_csv(z.open(text_file.filename)) 
       for text_file in z.infolist() 
       if text_file.filename.endswith('.csv')}
dfs.keys()

dict_keys(['Baby names/names1881.csv', 'Baby names/names1981.csv'])

In [19]:
names1881 = dfs['Baby names/names1881.csv']
names1881.head()

        Mary  F  6919
0       Anna  F  2698
1       Emma  F  2034
2  Elizabeth  F  1852
3   Margaret  F  1658
4     Minnie  F  1653

In [20]:
names1981 = dfs['Baby names/names1981.csv']
names1981.head()

  Jennifer  F  57032
0  Jessica  F  42519
1   Amanda  F  34370
2    Sarah  F  28162
3  Melissa  F  28003
4      Amy  F  20337

In [31]:
names1881.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1934 entries, 0 to 1933
Data columns (total 3 columns):
Mary    1934 non-null object
F       1934 non-null object
6919    1934 non-null int64
dtypes: int64(1), object(2)
memory usage: 45.4+ KB

In [ ]:
names1981.info()

## Import From a Webpage

In [24]:
import requests
import os

In [38]:
url = 'https://d17h27t6h515a5.cloudfront.net/topher/2017/August/599fd2ad_image-predictions/image-predictions.tsv'
response = requests.get(url)

folder = 'data/image-predictions'
if not os.path.exists(folder):
    os.makedirs(folder)
    
with open(os.path.join(folder, url.split('/')[-1]), mode='wb') as file:
    file.write(response.content)
    
os.listdir(folder)

img_predictions_df = pd.read_csv(folder + '/image-predictions.tsv', sep='\t')
img_predictions_df.head()

,tweet_id,jpg_url,img_num,p1,p1_conf,p1_dog,p2,p2_conf,p2_dog,p3,p3_conf,p3_dog
0,666020888022790149,https://pbs.twimg.com/media/CT4udn0WwAA0aMy.jpg,1,Welsh_springer_spaniel,0.465074,True,collie,0.156665,True,Shetland_sheepdog,0.061428,True
1,666029285002620928,https://pbs.twimg.com/media/CT42GRgUYAA5iDo.jpg,1,redbone,0.506826,True,miniature_pinscher,0.074192,True,Rhodesian_ridgeback,0.072010,True
2,666033412701032449,https://pbs.twimg.com/media/CT4521TWwAEvMyu.jpg,1,German_shepherd,0.596461,True,malinois,0.138584,True,bloodhound,0.116197,True
3,666044226329800704,https://pbs.twimg.com/media/CT5Dr8HUEAA-lEu.jpg,1,Rhodesian_ridgeback,0.408143,True,redbone,0.360687,True,miniature_pinscher,0.222752,True
4,666049248165822465,https://pbs.twimg.com/media/CT5IQmsXIAAKY4A.jpg,1,miniature_pinscher,0.560311,True,Rottweiler,0.243682,True,Doberman,0.154629,True

Another example from the UCI ML Repository on [wines](https://archive.ics.uci.edu/ml/datasets/Wine).

In [40]:
from urllib.request import urlretrieve

url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data'
attributes = ['alcohol', 'malic acid', 'ash', 'alcalinity of ash', 
              'magnesium', 'total phenols', 'flavanoids', 'nonflavanoid phenols', 
              'proanthocyanins', 'color intensity', 'hue', 'OD280/OD315 of diluted wines', 'proline']
wines = pd.read_csv(url, names=attributes)
wines.head()

,alcohol,malic acid,ash,alcalinity of ash,magnesium,total phenols,flavanoids,nonflavanoid phenols,proanthocyanins,color intensity,hue,OD280/OD315 of diluted wines,proline
1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

## Import From an API

In [27]:
import tweepy
import json

Beware sxposing your API secrets and keys. [Take precautions](https://medium.freecodecamp.org/how-to-securely-store-api-keys-4ff3ea19ebda).

In [28]:
key = "XXXX"
key_secret = "XXXX"
token = "XXXX"
token_secret = "XXXX"

auth = tweepy.OAuthHandler(key, key_secret)
auth.set_access_token(token, token_secret)

api = tweepy.API(auth)

In [41]:
tweet_archive_df = pd.read_csv('data/twitter-archive-enhanced.csv')
tweet_ids = list(tweet_archive_df.tweet_id)

tweet_data = {}
for tweet in tweet_ids:
    try:
        tweet_status = api.get_status(tweet, wait_on_rate_limit=True, wait_on_rate_limit_notify=True)
        tweet_data[str(tweet)] = tweet_status._json
#         print(tweet_ids.index(tweet) + 1, "/", "2354")
    except:
        print("Error for: " + str(tweet))
        print(tweet_ids.index(tweet) + 1, "/", "2354")

Error for: 888202515573088257
20 / 2354
Error for: 873697596434513921
96 / 2354
Error for: 872668790621863937
102 / 2354
Error for: 869988702071779329
119 / 2354
Error for: 866816280283807744
133 / 2354
Error for: 861769973181624320
156 / 2354
Error for: 845459076796616705
248 / 2354
Error for: 842892208864923648
261 / 2354
Error for: 837012587749474308
299 / 2354

Rate limit reached. Sleeping for: 391

Error for: 827228250799742977
383 / 2354
Error for: 812747805718642688
507 / 2354
Error for: 802247111496568832
567 / 2354
Error for: 775096608509886464
785 / 2354
Error for: 770743923962707968
819 / 2354
Error for: 754011816964026368
933 / 2354

Rate limit reached. Sleeping for: 616

Error for: 680055455951884288
1727 / 2354

Rate limit reached. Sleeping for: 625

In [43]:
with open('data/tweet_json.txt', 'w') as file:
    json.dump(tweet_data, file)

In [44]:
with open('data/tweet_json.txt') as file:
    data = json.load(file)
    
df_list = []

for tweet_id in data.keys():
    retweets = data[tweet_id]['retweet_count']
    favorites = data[tweet_id]['favorite_count']# + data[tweet_id]['favourites_count']
    df_list.append({'tweet_id': tweet_id,
                        'retweets': retweets,
                        'favorites': favorites})
    
tweets_df = pd.DataFrame(df_list, columns = ['tweet_id', 'retweets', 'favorites'])
tweets_df.head()

             tweet_id  retweets  favorites
0  892420643555336193      8295      37977
1  892177421306343426      6123      32602
2  891815181378084864      4054      24551
3  891689557279858688      8433      41307
4  891327558926688256      9133      39501